In [12]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [13]:
%%sql
drop database if exists uber;
create database uber;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.
1 rows affected.

[]

In [17]:
%%sql
use uber;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [ ]:
Primary key

In [14]:
%%sql
drop table if exists uber.rides;
create table uber.rides (
    ride_id INT PRIMARY KEY,
    driver_id INT NOT NULL,
    rider_id INT NOT NULL,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10,2) NOT NULL
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [21]:
%%sql
INSERT INTO uber.rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1' for key 'rides.PRIMARY'
[SQL: INSERT INTO uber.rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [22]:
%%sql
select * from uber.rides

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(1, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00')),
 (2, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00'))]

Composite primary key

In [26]:
%%sql
drop table if exists uber.rides;
create table uber.rides (
    ride_id INT,
    driver_id INT NOT NULL,
    rider_id INT NOT NULL,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10,2) NOT NULL,
    primary key (ride_id,rider_id)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [30]:
%%sql
desc uber.rides

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'NO', 'PRI', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [33]:
%%sql
INSERT INTO uber.rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(2, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

Unique Constraint

In [35]:
%%sql
drop table if exists users;
create table users (
    user_id INT PRIMARY KEY,
    mail VARCHAR(100) UNIQUE
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [36]:
%%sql
desc uber.USERS

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[('user_id', 'int', 'NO', 'PRI', None, ''),
 ('mail', 'varchar(100)', 'YES', 'UNI', None, '')]

In [42]:
%%sql
INSERT INTO users (user_id, mail)
VALUES(2,'user2@example.com');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

Unlike primary key , unique allows any number of null values

In [43]:
%%sql
INSERT INTO users (user_id, mail)
VALUES(3,NULL);

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [46]:
%%sql
select * from uber.users
order by user_id;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(1, 'user1@example.com'), (2, 'user2@example.com'), (3, None)]

In [47]:
%%sql
INSERT INTO users (user_id, mail)
VALUES(NULL,'user2@example.com');

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1048 (23000): Column 'user_id' cannot be null
[SQL: INSERT INTO users (user_id, mail)
VALUES(NULL,'user2@example.com');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [48]:
%%sql
INSERT INTO users (user_id, mail)
VALUES(4,'user2@example.com');

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry 'user2@example.com' for key 'users.mail'
[SQL: INSERT INTO users (user_id, mail)
VALUES(4,'user2@example.com');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

cannot be used like composite (for idiots)

In [50]:
%%sql
drop table if exists uber.rides;
create table uber.rides (
    ride_id INT PRIMARY KEY,
    driver_id INT NOT NULL,
    rider_id INT ,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10,2) NOT NULL
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [52]:
%%sql
desc uber.rides

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'YES', '', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [51]:
%%sql
INSERT INTO uber.rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, NULL, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [55]:
%%sql
select * from uber.rides;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(1, 101, None, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00'))]

Check

In [56]:
%%sql
drop table if exists uber.rides;
create table uber.rides (
    ride_id INT PRIMARY KEY,
    driver_id INT NOT NULL,
    rider_id INT ,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10,2) CHECK (fare>0)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [58]:
%%sql
INSERT INTO uber.rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', -500.00);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.DatabaseError) 3819 (HY000): Check constraint 'rides_chk_1' is violated.
[SQL: INSERT INTO uber.rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', -500.00);]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

In [59]:
%%sql
INSERT INTO uber.rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

Foreign Key

In [61]:
%%sql
drop table if exists uber.rides;
drop table if exists uber.drivers;
-- Creating the drivers table
CREATE TABLE uber.drivers (
    driver_id INT PRIMARY KEY,
    driver_name VARCHAR(100),
    license_number VARCHAR(50) UNIQUE
);

-- Creating the rides table with driver_id as a foreign key
CREATE TABLE uber.rides (
    ride_id INT PRIMARY KEY,
    driver_id INT,
    pickup_location VARCHAR(100),
    dropoff_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10, 2),
    FOREIGN KEY (driver_id) REFERENCES drivers(driver_id)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [67]:
%%sql
desc uber.drivers;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('driver_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_name', 'varchar(100)', 'YES', '', None, ''),
 ('license_number', 'varchar(50)', 'YES', 'UNI', None, '')]

In [68]:
%%sql
INSERT INTO drivers (driver_id, driver_name, license_number)
VALUES
(101, 'John Doe', 'XYZ12345'),
(102, 'Jane Smith', 'ABC67890');

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[]

In [75]:
%%sql
select * from drivers

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(101, 'John Doe', 'XYZ12345'), (102, 'Jane Smith', 'ABC67890')]

In [72]:
%%sql
--truncate table rides

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [73]:
%%sql
INSERT INTO rides (ride_id, driver_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(301, 101, 'Chennai', 'Coimbatore', '2024-12-01 08:00:00', 500.00),
(302, 101, 'Chennai', 'Madurai', '2024-12-01 09:30:00', 600.00),
(303, 102, 'Bangalore', 'Hyderabad', '2024-12-02 10:00:00', 700.00);

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[]

In [76]:
%%sql
select * from rides

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(301, 101, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00')),
 (302, 101, 'Chennai', 'Madurai', datetime.datetime(2024, 12, 1, 9, 30), Decimal('600.00')),
 (303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 2, 10, 0), Decimal('700.00'))]

Cannot add or update a child row if the primary key or unique key does not exist in the refereced table then the foreign key constraint fails

In [74]:
%%sql
INSERT INTO rides (ride_id, driver_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(304 ,999, 'Chennai', 'Coimbatore', '2024-12-01 08:00:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1452 (23000): Cannot add or update a child row: a foreign key constraint fails (`uber`.`rides`, CONSTRAINT `rides_ibfk_1` FOREIGN KEY (`driver_id`) REFERENCES `drivers` (`driver_id`))
[SQL: INSERT INTO rides (ride_id, driver_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(304 ,999, 'Chennai', 'Coimbatore', '2024-12-01 08:00:00', 500.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

Cannot delete a parent row if the primary key or unique key is refereced by a child table then the foreign key constraint fails

In [77]:
%%sql
delete from drivers where driver_id=101

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1451 (23000): Cannot delete or update a parent row: a foreign key constraint fails (`uber`.`rides`, CONSTRAINT `rides_ibfk_1` FOREIGN KEY (`driver_id`) REFERENCES `drivers` (`driver_id`))
[SQL: delete from drivers where driver_id=101]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

Child row can be deleted since it is not referenced

In [78]:
%%sql
delete from rides where driver_id=303

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

ON DELETE CASCADE - used to delete the referenced entity with its associations or references

In [79]:
%%sql
drop table if exists uber.rides;
drop table if exists uber.drivers;
-- Creating the drivers table
CREATE TABLE uber.drivers (
    driver_id INT PRIMARY KEY,
    driver_name VARCHAR(100),
    license_number VARCHAR(50) UNIQUE
);

-- Creating the rides table with driver_id as a foreign key
CREATE TABLE uber.rides (
    ride_id INT PRIMARY KEY,
    driver_id INT,
    pickup_location VARCHAR(100),
    dropoff_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10, 2),
    FOREIGN KEY (driver_id) REFERENCES drivers(driver_id) ON DELETE CASCADE
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [80]:
%%sql
INSERT INTO drivers (driver_id, driver_name, license_number)
VALUES
(101, 'John Doe', 'XYZ12345'),
(102, 'Jane Smith', 'ABC67890');

INSERT INTO rides (ride_id, driver_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(301, 101, 'Chennai', 'Coimbatore', '2024-12-01 08:00:00', 500.00),
(302, 101, 'Chennai', 'Madurai', '2024-12-01 09:30:00', 600.00),
(303, 102, 'Bangalore', 'Hyderabad', '2024-12-02 10:00:00', 700.00);

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.
3 rows affected.

[]

In [82]:
%%sql
select * from drivers

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(101, 'John Doe', 'XYZ12345'), (102, 'Jane Smith', 'ABC67890')]

In [84]:
%%sql
select * from rides

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(301, 101, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00')),
 (302, 101, 'Chennai', 'Madurai', datetime.datetime(2024, 12, 1, 9, 30), Decimal('600.00')),
 (303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 2, 10, 0), Decimal('700.00'))]

In [85]:
%%sql
delete from drivers where driver_id=101

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [86]:
%%sql
select * from drivers

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(102, 'Jane Smith', 'ABC67890')]

In [87]:
%%sql
select * from rides

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 2, 10, 0), Decimal('700.00'))]

Soft delete

In [88]:
%%sql
drop table if exists uber.rides;
drop table if exists uber.drivers;
-- Creating the drivers table
CREATE TABLE uber.drivers (
    driver_id INT PRIMARY KEY,
    driver_name VARCHAR(100),
    license_number VARCHAR(50) UNIQUE
);

-- Creating the rides table with driver_id as a foreign key
CREATE TABLE uber.rides (
    ride_id INT PRIMARY KEY,
    driver_id INT,
    pickup_location VARCHAR(100),
    dropoff_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10, 2),
    FOREIGN KEY (driver_id) REFERENCES drivers(driver_id)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [89]:
%%sql
INSERT INTO drivers (driver_id, driver_name, license_number)
VALUES
(101, 'John Doe', 'XYZ12345'),
(102, 'Jane Smith', 'ABC67890');

INSERT INTO rides (ride_id, driver_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(301, 101, 'Chennai', 'Coimbatore', '2024-12-01 08:00:00', 500.00),
(302, 101, 'Chennai', 'Madurai', '2024-12-01 09:30:00', 600.00),
(303, 102, 'Bangalore', 'Hyderabad', '2024-12-02 10:00:00', 700.00);

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.
3 rows affected.

[]

In [90]:
%%sql
alter table rides add column is_delete boolean default false;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [91]:
%%sql
desc rides

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'YES', 'MUL', None, ''),
 ('pickup_location', 'varchar(100)', 'YES', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'YES', '', None, ''),
 ('ride_date', 'datetime', 'YES', '', None, ''),
 ('fare', 'decimal(10,2)', 'YES', '', None, ''),
 ('is_delete', 'tinyint(1)', 'YES', '', '0', '')]

In [92]:
%%sql
select * from rides

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(301, 101, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00'), 0),
 (302, 101, 'Chennai', 'Madurai', datetime.datetime(2024, 12, 1, 9, 30), Decimal('600.00'), 0),
 (303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 2, 10, 0), Decimal('700.00'), 0)]

In [93]:
%%sql
update rides set is_delete=true where driver_id=102

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [94]:
%%sql
select * from rides

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(301, 101, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00'), 0),
 (302, 101, 'Chennai', 'Madurai', datetime.datetime(2024, 12, 1, 9, 30), Decimal('600.00'), 0),
 (303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 2, 10, 0), Decimal('700.00'), 1)]

default

In [95]:
%%sql
create table demo1 (sno int , name varchar(100) , country varchar(3) default 'IND');

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [98]:
%%sql
desc demo1

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('sno', 'int', 'YES', '', None, ''),
 ('name', 'varchar(100)', 'YES', '', None, ''),
 ('country', 'varchar(3)', 'YES', '', 'IND', '')]

In [115]:
%%sql
insert into demo1(sno,name) values (1,'Manoj')

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [116]:
%%sql
insert into demo1(sno,name,country) values (2,'Manoj','USA')

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [117]:
%%sql
select * from demo1

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(1, 'Manoj', 'IND'), (2, 'Manoj', 'USA')]

In [114]:
%%sql
-- truncate table demo1

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]